cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/ethercat/renesas/samplesemi.c
/*
* This source file is part of the EtherCAT Slave Stack Code licensed by Beckhoff Automation GmbH & Co KG, 33415 Verl, Germany.
* The corresponding license agreement applies. This hint shall not be removed.
*/

/*-----------------------------------------------------------------------------------------
------
------    Includes
------
-----------------------------------------------------------------------------------------*/
#include "hal_data.h"

#define _SEMI_SAMPLE_APPLICATION_
#include "samplesemi.h"
#undef _SEMI_SAMPLE_APPLICATION_

#include "sdoserv.h"
#include "objdef.h"
#include "ecatslv.h"
#include "samplefoe.h"
#include "bootmode.h"
#include "r_fw_up_buf.h"
#include <stdio.h>

/*-----------------------------------------------------------------------------------------
------
------    local variables and constants
------
-----------------------------------------------------------------------------------------*/
extern const UINT16 cBitMask[16];
extern TOBJECT OBJMEM * ObjDicList;

#if BACKUP_PARAMETER_SUPPORTED
static UINT16 write_store_parameter[BACKUP_MEMORY_SIZE_BYTE/2];
#endif
/*-----------------------------------------------------------------------------------------
------
------    generic functions
------
-----------------------------------------------------------------------------------------*/

#if BACKUP_PARAMETER_SUPPORTED
/*******************************************************************************
* Function Name: EE_ResetFlashData
* Description  : This function shall clear the backup parameter memory. It is called from “InitDefaultEntries()”
* Arguments    : none
* Return Value : none
*******************************************************************************/
void EE_ResetFlashData(void)
{

	UINT8 * erase_dest = (UINT8 *)BACKUP_MEMORY_START_ADDRESS;
	if (Check_StoreParameterAddress((UINT32)erase_dest) == false)
	{
		/*---------- Exit ----------*/
	    UINT8 message[] = "address is wrong in EE_ResetFlashData().\r\n";
	    printf("%s", message);
		return;
	}

	/*---------- Erase non-volatile memory for Store Parameter ----------*/
	R_MRAM_Erase(&g_mram0_ctrl, (UINT32)erase_dest, BACKUP_MEMORY_SIZE_BLOCK);

	/*---------- Verify erasing ----------*/
	for (UINT32 i = 0; i < BACKUP_MEMORY_SIZE_BYTE/4; i++)
	{
	    UINT32 *read_addr = (UINT32 *)(BACKUP_MEMORY_START_ADDRESS + i*4);
		if (0xFFFFFFFF != *read_addr)
		{
			UINT8 message[] = "R_MRAM_Erase() is failure in EE_ResetFlashData().\r\n";
			printf("%s", message);
			return;
		}
	}
	/** Erasing non-volatile memory for Store Parameter is complete. **/

#ifdef UART_DEBUG
	UINT8 message[] = "EE_ResetFlashData() is complete.\r\n";
	printf("%s", message);
#endif

} /* End of function EE_ResetFlashData() */

/*******************************************************************************
* Function Name: EE_GetChecksum
* Description  : This function shall return a 32Bit Crc for the backup parameter memory. The return value is stored in 0x10F0.1
* Arguments    : none
* Return Value : UINT32 : Checksum over the stored backup data
*******************************************************************************/
UINT32 EE_GetChecksum(void)
{
	UINT32 u32Checksum = 0;

	/** In this sample program, EE_GetChecksum() is not supported. **/

	return u32Checksum;
} /* End of function EE_GetChecksum() */

/*******************************************************************************
* Function Name: EE_IsDefaultDataInitialized
* Description  : The function is called on slave power up (from “COE_ObjInit()”) and shall check if the backup parameter memory was already initialized.
* Arguments    : none
* Return Value : UINT8 : 0 if the backup parameter memory was not initialized yet. not 0 if the memory was initialized.
*******************************************************************************/
UINT8 EE_IsDefaultDataInitialized(void)
{

	UINT8 result = 0;
	UINT16 *ReadData = (UINT16 *)BACKUP_MEMORY_START_ADDRESS;

	/* Check if default data is initialized. */
	if (Default_Data_Is_Initialized == *ReadData)
	{
		/* The backup parameter memory was already initialized. */
		result = 1;
	}
	else
	{
		result = 0;
	}

#ifdef UART_DEBUG
	if (result == 1)
	{
		UINT8 message[] = "the backup parameter memory was already initialized.\r\n";
		printf("%s", message);
	}
	else
	{
		UINT8 message[] = "the backup parameter memory was not initialized.\r\n";
		printf("%s", message);
	}
#endif

	return result;
} /* End of function EE_IsDefaultDataInitialized() */

/*******************************************************************************
* Function Name: EE_StoreDefaultData
* Description  : The function is called after the default parameter values are written to the memory. Called from “InitDefaultEntries()”
* Arguments    : none
* Return Value : none
*******************************************************************************/
void EE_StoreDefaultData(void)
{
	/** First word of the beginning of the backup memory checks if default backup parameters has been initialized. **/

	uint8_t * write_dest = (uint8_t *)BACKUP_MEMORY_START_ADDRESS;	//Write to Code MRAM.
	if (Check_StoreParameterAddress((UINT32)write_dest) == false)
	{
		/* Exit */
	    UINT8 message[] = "address is wrong in EE_StoreDefaultData().\r\n";
	    printf("%s", message);
		return;
	}

	UINT8 write_data[2];
	write_data[0] = Default_Data_Is_Initialized & 0x00FF;
	write_data[1] = (Default_Data_Is_Initialized & 0xFF00) >> 8;
	/* Write to first word of the beginning of non-volatile memory for Store Parameter */
	fsp_err_t err = R_MRAM_Write(&g_mram0_ctrl, &write_data[0], write_dest, 2);
	if (err != FSP_SUCCESS)
	{
		UINT8 message[] = "Writing to MRAM is failed in EE_StoreDefaultData().\r\n";
		printf("%s", message);
		return;
	}

	/* check if the written data is correct. */
	if (Default_Data_Is_Initialized != *(UINT16 *)write_dest)
	{
		UINT8 message[] = "Writing to first word of the beginning of non-volatile memory for Store Parameter is failure.\r\n";
		printf("%s", message);
	}
	else
	{
#ifdef UART_DEBUG
		/** Writing to first word of the beginning of non-volatile memory for Store Parameter is complete. **/
		UINT8 message[] = "Writing to first word of the beginning of non-volatile memory for Store Parameter is complete.\r\n";
		printf("%s", message);
#endif
	}

} /* End of function EE_StoreDefaultData() */

