cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/ethercat/renesas/samplesemi.c
/*******************************************************************************
* Function Name: EE_LoadDefaultData
* Description  : The function is called before the default parameter values are read from the memory. Called from “LoadDefaultEntries()”
* Arguments    : none
* Return Value : none
*******************************************************************************/
void EE_LoadDefaultData(void)
{

	/** In this sample program, EE_LoadDefaultData() is not supported. **/

} /* End of function EE_LoadDefaultData() */

/*******************************************************************************
* Function Name: EE_ReadWordsFromNonVolatileMemory
* Description  : The function shall copy the stored parameter values to referenced pointer (referencing the object entry). Called from “LoadBackupEntries ()”
* Arguments    : UINT16 * pDest   : destination memory to store the data
				 UINT16 srcOffset : offset within the non-volatile memory
				 UINT16 n         : number of words to be read
* Return Value : none
*******************************************************************************/
void EE_ReadWordsFromNonVolatileMemory(UINT16 HUGE *pDest, UINT16 srcOffset, UINT16 n)
{
    volatile UINT8 dummy_read = 0;
    UINT16 * src = NULL;
    UINT32 i = 0;
    BOOL verify = true;

	/* Copy the store parameters from non-volatile memory. */
    for (i = 0; i < n; i++)
    {
        src = (UINT16 *)(BACKUP_MEMORY_START_ADDRESS + (UINT32)srcOffset*2 + i*2);
        if (Check_StoreParameterAddress((UINT32)src) == false)
        {
            /* Exit */
            UINT8 message[] = "address is wrong in EE_ReadWordsFromNonVolatileMemory().\r\n";
            printf("%s", message);
            return;
        }
        pDest[i] = *src;

    }

    /* Verify */
    for (i = 0; i < n; i++)
    {
        src = (UINT16 *)(BACKUP_MEMORY_START_ADDRESS + (UINT32)srcOffset*2 + i*2);
        if (pDest[i] != *src)
        {
            verify = false;
        }
    }

    if (verify == false)
    {
        UINT8 message[] = "EE_ReadWordsFromNonVolatileMemory() is failure.\r\n";
        printf("%s", message);
    }

    FSP_PARAMETER_NOT_USED(dummy_read);

} /* End of function EE_ReadWordsFromNonVolatileMemory() */

/*******************************************************************************
* Function Name: EE_WriteWordsToNonVolatileMemory
* Description  : The function shall copy the data to the non-volatile memory. Called from “InitDefaultEntries()” ,StoreBackupEntries(), COE_WriteBackupEntry().
* Arguments    : UINT16 dstOffset : offset(word size) within the non-volatile memory
				 UINT16 * pSrc    : source memory to read the data
				 UINT16 n         : number of words to be read
* Return Value : UINT32 : new checksum over the whole stored data
*******************************************************************************/
UINT32 EE_WriteWordsToNonVolatileMemory(UINT16 destOffset, UINT16 HUGE * pSrc, UINT16 n)
{
	/** This sample program is not supported by checksum **/

	UINT32 * read_dst = NULL;
	UINT32 * write_buffer_addr = (UINT32 *)&write_store_parameter[0];
	volatile UINT8 dummy_read = 0;

	/*　Before erasing, copy the current memory. */
    for (UINT32 i = 0; i < BACKUP_MEMORY_SIZE_BYTE/4; i++)
    {
        read_dst = (UINT32 *)(BACKUP_MEMORY_START_ADDRESS + i*4);
        if (Check_StoreParameterAddress((UINT32)read_dst) == false)
        {
            /* Exit */
            UINT8 message[] = "address is wrong in EE_WriteWordsToNonVolatileMemory().\r\n";
            printf("%s", message);
            return 0;
        }
        write_buffer_addr[i] = *read_dst;
    }

	/* Erase non-volatile memory for Store Parameter */
	R_MRAM_Erase(&g_mram0_ctrl, BACKUP_MEMORY_START_ADDRESS, BACKUP_MEMORY_SIZE_BLOCK);

	/* Verify erasing */
	for (UINT32 i = 0; i < BACKUP_MEMORY_SIZE_BYTE/4; i++)
	{
		if (0xFFFFFFFF != *(UINT32 *)(BACKUP_MEMORY_START_ADDRESS + i*4))
		{
			UINT8 message[] = "R_MRAM_Erase() is failure in EE_WriteWordsToNonVolatileMemory().\r\n";
			printf("%s", message);

			return 0;
		}
	}
	/** Erasing non-volatile memory for Store Parameter is complete. **/

	/* Change the write_store_parameter array */
	for (UINT32 i = 0; i < n; i++)
	{
		write_store_parameter[destOffset + i] = pSrc[i];
	}

	/* Write to non-volatile memory for Store Parameter */
	UINT32 write_byte = FW_UP_WRITE_ATONCE_SIZE;
	for (UINT32 i = 0; i < BACKUP_MEMORY_SIZE_BYTE/write_byte; i++)
	{
		/* Set write_dst */
		UINT16 * write_dst = (UINT16 *)(BACKUP_MEMORY_START_ADDRESS + i*write_byte);
		if (Check_StoreParameterAddress((UINT32)write_dst) == false)
		{
			UINT8 message[] = "write_dst is incorrect in EE_WriteWordsToNonVolatileMemory().\r\n";
			printf("%s", message);
			return 0;
		}

		/* Write */
		fsp_err_t err = R_MRAM_Write(&g_mram0_ctrl, (UINT32 *)(&write_store_parameter[i*write_byte/2]), (UINT32 *)write_dst, write_byte);
		if (err != FSP_SUCCESS)
		{
			UINT8 message[] = "Writing to MRAM is failed in EE_WriteWordsToNonVolatileMemory().\r\n";
			printf("%s", message);
			return 0;
		}

	}

	/* Verify if the written data is correct. */
	for (UINT32 i = 0; i < BACKUP_MEMORY_SIZE_BYTE/2; i++)
	{
	    UINT32 read_addr = BACKUP_MEMORY_START_ADDRESS + i*2;
		if (write_store_parameter[i] != *(UINT16 *)read_addr)
		{
			UINT8 message[] = "the written data is incorrect in EE_WriteWordsToNonVolatileMemory().\r\n";
			printf("%s", message);

			return 0;
		}
	}
	/** EE_WriteWordsToNonVolatileMemory() is complete. **/

	Print_WriteWordsToNonVolatileMemory(destOffset);

    FSP_PARAMETER_NOT_USED(dummy_read);

	/** This sample program is not supported by checksum **/
	return 0;
} /* End of function EE_WriteWordsToNonVolatileMemory() */

/*******************************************************************************
* Function Name: Check_StoreParameterAddress
* Description  : This function checks if address is in non-volatile memory for Store Parameter.
* Arguments    : UINT32 address : memory address
* Return Value : none
*******************************************************************************/
BOOL Check_StoreParameterAddress(const UINT32 address)
{
    if ((BACKUP_MEMORY_START_ADDRESS <= address) &&
            (address <= (BACKUP_MEMORY_START_ADDRESS + BACKUP_MEMORY_SIZE_BYTE)))
    {
        return true;
    }
    else if ((BACKUP_MEMORY_START_ADDRESS <= address) &&
            (address <= (BACKUP_MEMORY_START_ADDRESS + BACKUP_MEMORY_SIZE_BYTE)))
    {
        return true;
    }

