cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/ethercat/renesas/samplesemi.c
	return false;
}

/*******************************************************************************
* Function Name: Print_WriteWordsToNonVolatileMemory
* Description  : This function prints writing store parameter to non-volatile memory
* Arguments    : UINT16 dstOffset : offset(word size) within the non-volatile memory
				 UINT16 * pSrc    : source memory to read the data
				 UINT16 n         : number of words to be read
* Return Value : none
*******************************************************************************/
void Print_WriteWordsToNonVolatileMemory(UINT16 destOffset)
{
	if (destOffset < NonVolatileWordOffset_0xF3A1)
	{
		UINT8 message[] = "Index 0x10F0 backup is success.\r\n";
		printf("%s", message);
	}
	else if (destOffset < NonVolatileWordOffset_0xF3A2)
	{
		UINT8 message[] = "Index 0xF3A1 backup is success.\r\n";
		printf("%s", message);
	}
	else if (destOffset < NonVolatileWordOffset_0xF3A3)
	{
		UINT8 message[] = "Index 0xF3A2 backup is success.\r\n";
		printf("%s", message);
	}
	else if (destOffset < NonVolatileWordOffset_0xF3A4)
	{
		UINT8 message[] = "Index 0xF3A3 backup is success.\r\n";
		printf("%s", message);
	}
	else if (destOffset < NonVolatileWordOffset_0xF3A5)
	{
		UINT8 message[] = "Index 0xF3A4 backup is success.\r\n";
		printf("%s", message);
	}
	else if (destOffset < NonVolatileWordOffset_0xF3A6)
	{
		UINT8 message[] = "Index 0xF3A5 backup is success.\r\n";
		printf("%s", message);
	}
	else if (destOffset < NonVolatileWordOffset_0xF3A7)
	{
		UINT8 message[] = "Index 0xF3A6 backup is success.\r\n";
		printf("%s", message);
	}
	else if (destOffset < NonVolatileWordOffset_0xF3A8)
	{
		UINT8 message[] = "Index 0xF3A7 backup is success.\r\n";
		printf("%s", message);
	}
	else
	{
		UINT8 message[] = "Index 0xF3A8 backup is success.\r\n";
		printf("%s", message);
	}

} /* End of function Print_WriteWordsToNonVolatileMemory() */

#endif // #if BACKUP_PARAMETER_SUPPORTED

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \param   Index             index of the requested object.
 \param   Subindex          subindex of the requested object.
 \param   Size              Size of the object, returned by the function OBJ_GetObjectLength which was called before
 \param   pData             Pointer to the buffer where the read data shall be copied to
 \param   bCompleteAccess   Indicates if a complete read of all subindices of the object shall be done or not

 \return  result of the read operation (0 (success) or an abort code (ABORTIDX_.... defined in sdosrv.h))

 \brief   This function reads the requested object 0xFBFx
*////////////////////////////////////////////////////////////////////////////////////////
UINT8 ReadFunction0xFBFx( UINT16 Index, UINT8 Subindex, UINT32 Size, UINT16 MBXMEM * pData, UINT8 bCompleteAccess )
{

	TOBJECT OBJMEM * LocalObjDic = ObjDicList;
	UINT16 i;
	OBJCONST TSDOINFOENTRYDESC OBJMEM *pEntry;
	OBJCONST TOBJECT OBJMEM * pObjEntry = NULL;
	for (i = 0; i < 0xFFFF; i++){
		if ( LocalObjDic->Index == Index ){
			pObjEntry = LocalObjDic;
			break;
		}
		LocalObjDic = LocalObjDic->pNext;
	}
	if ( pObjEntry == NULL ){
		return ABORTIDX_OBJECT_NOT_EXISTING;
	}

	UINT16 index = Index;
	UINT8 subindex = Subindex;

	/* lastSubindex is used for complete access to make loop over the requested entries
	to be read, we initialize this variable with the requested subindex that only
	one loop will be done for a single access */
	UINT16 lastSubindex = subindex;

	/* get the information of ObjCode and MaxSubindex in local variables to support different types of microcontroller */
	UINT8 objCode = (pObjEntry->ObjDesc.ObjFlags & OBJFLAGS_OBJCODEMASK) >> OBJFLAGS_OBJCODESHIFT;
	UINT16 maxSubindex = (pObjEntry->ObjDesc.ObjFlags & OBJFLAGS_MAXSUBINDEXMASK) >> OBJFLAGS_MAXSUBINDEXSHIFT;

	UINT8 bRead = 0x0;
	UINT8 result = 0;

	if ( objCode != OBJCODE_VAR && index >= 0x1000 )
	{
		/* if the object is an array or record we have to get the maxSubindex from the
		actual value of subindex 0, which is stored as UINT16 at the beginning of the
		object's variable */
		maxSubindex = (*((UINT16 *) (pObjEntry->pVarPtr))) & 0x00FF;
	}

	if ( bCompleteAccess )
	{
		if ( objCode == OBJCODE_VAR || index < 0x1000 )
		{
			/* complete access is not supported with simple objects or ENUM descriptions */
			return ABORTIDX_UNSUPPORTED_ACCESS;
		}

		/* we read until the maximum subindex */
		lastSubindex = maxSubindex;
	}

	/* a variable object is read */
	for (i = subindex; i <= lastSubindex; i++)
	{
		/* if only a single entry is requested, this loop will only be done once */
		UINT16 MBXMEM *pVarPtr = (UINT16 MBXMEM *) pObjEntry->pVarPtr;
		UINT16 bitOffset = 0;

		if (i == 0)
		{
			/* subindex 0 is requested, the entry's data is at the beginning of the object's variable */
		}
		else if ( index >= 0x1000 )
		{
			/* subindex 1-n of an variable object is requested, we get the offset of the variable here */
			bitOffset = OBJ_GetEntryOffset((UINT8)i, pObjEntry);
		}

		/* we increment the variable pointer to the corresponding word address */
		pVarPtr += (bitOffset >> 4);

		/* get the corresponding entry description */
		pEntry = OBJ_GetEntryDesc(pObjEntry, (UINT8)i);
		if (0 != (((UINT8) ((pEntry->ObjAccess & ACCESS_READ)<<1)) & (nAlStatus & STATE_MASK)) )
		{
			if ( i == subindex                                     /* requested entry */
				|| (bCompleteAccess && i >= subindex) )       /* complete access and entry should be read */
			{
				UINT16 bitMask;

				/* we have to copy the entry */
				if ( i == 0 && objCode != OBJCODE_VAR )
				{
					/* we read subindex 0 of an array or record */
					{
						pData[0] = SWAPWORD((UINT16)maxSubindex);
					}

					/* we increment the destination pointer by 2 because the subindex 0 will be
					transmitted as UINT16 for a complete access */
					pData++;
				}
				else
				{
					UINT16 dataType = pEntry->DataType;

					if (pEntry->DataType >= 0x700)
					{
						/* the ENUM data types are defined from index 0x700 in this example
						convert in standard data type for the read access */
						if ( pEntry->BitLength <= 8 )
						{
							dataType = DEFTYPE_BIT1-1+pEntry->BitLength;
						}
						else if ( pEntry->BitLength == 16 )
						{
							dataType = DEFTYPE_UNSIGNED16;
						}
						else if ( pEntry->BitLength == 32 )
						{
							dataType = DEFTYPE_UNSIGNED32;
						}
					}

