cl234583745/ra8/10_ra8t2_ecat_foe_dual-bank swap/prj/RA8T2_MCK_esc_ETG5003_CPU0/src/ethercat/renesas/samplesemi.c
					switch (dataType)
					{
					case DEFTYPE_NULL:
						if(bCompleteAccess)
						{
							/*Handle alignment entry*/
							if (((pEntry->BitLength & 0xF) > 0)
								&& (((bitOffset + pEntry->BitLength) & 0x0F) == 0 ))
							{
								/* we have reached the UINT16 border */
								pData++;
							}

							/*increment WORD offset*/
							pData += ((pEntry->BitLength & 0xF0) >> 4);
						}
						else
						{
							return ABORTIDX_DATA_CANNOT_BE_READ_OR_STORED;
						}
						break;
					case    DEFTYPE_UNSIGNED8:
						{
							/* depending on the bitOffset we have to copy the Hi or the Lo-Byte */
							UINT16 TmpValue = 0x0000;

							bitMask = cBitMask[pEntry->BitLength] << (bitOffset & 0x0F);

							/*Swap object data (if required); all masks and offsets are defined for little endian format*/
							TmpValue = SWAPWORD(pVarPtr[0]);

							/*Clear pData if the first bits within the WORD memory will be copied*/
							if ((bitOffset & 0x0F) == 0)
							{
								pData[0] = 0;
							}

							pData[0] = SWAPWORD(pData[0]);

							if (bCompleteAccess)
							{
								/*shifting is not required for Complete access because the bits are set to the correct offset by the master*/
								pData[0] |= TmpValue & bitMask;
							}
							else
							{
								/*Shift Bits to the beginning of the mailbox memory*/
								pData[0] |= ((TmpValue & bitMask) >> (bitOffset & 0x0F));
							}

							pData[0] = SWAPWORD(pData[0]);
							if ( ((bitOffset + pEntry->BitLength) & 0x0F) == 0 )
							{
								/* we have reached the UINT16 border */
								pData++;
							}

						}
						break;
					case    DEFTYPE_OCTETSTRING:
						if(bitOffset & 0xF)
						{
							/* fill in the 1 Byte that are not filled in. */
							UINT16 TmpValue = pVarPtr[0];
							OBJTOMBXMEMCPY(pData, &TmpValue, 2);
							/* we have reached the UINT16 border */
							pData++;
							pVarPtr++;

							UINT16 RemainingReadByte = BIT2BYTE(pEntry->BitLength) - 1;
							/*Read two bytes at a time*/
							while( RemainingReadByte > 2 )
							{
								OBJTOMBXMEMCPY(pData, pVarPtr, 2);
								/* we have reached the UINT16 border */
								pData++;
								pVarPtr++;
								RemainingReadByte -= 2;
							}

							/*copy only 1 byte*/
							if (RemainingReadByte == 1)
							{
								UINT8 *tmp = NULL;
								tmp = (UINT8 *) pVarPtr;
								TmpValue = tmp[0] & 0x00FF;
								OBJTOMBXMEMCPY(pData, &TmpValue, 2);
							}

							break;
						}

						OBJTOMBXMEMCPY(pData, pVarPtr, BIT2BYTE(pEntry->BitLength));

						pData += BIT2WORD((pEntry->BitLength & ~0xF));

						if((pEntry->BitLength & 0xF) != 0)
						{
							/*current entry has an odd word length => clear last byte of next word*/
							*pData &= 0xFF;
						}

						break;
					default:
						/* other data types are not supported from this example */
						return ABORTIDX_DATA_CANNOT_BE_READ_OR_STORED;
					} //switch (deftype)

					bRead = 1;
				}
			}
		}
		else
		{
			/*No access to current object entry => shift pData if required*/
			UINT8 cnt = 0;

			/*If this entry is the first in the 16Bit block clear the memory*/
			if ((bitOffset & 0x0F) == 0)
			{
				*pData = 0;
			}

			/*Handle Bit/Byte Offset*/
			if (((pEntry->BitLength & 0xF) > 0)
				&& (((bitOffset + pEntry->BitLength) & 0x0F) == 0 ))
			{
				/* we have reached the UINT16 border */
				pData++;

				/*Clear new buffer*/
				*pData = 0;
			}

			/*increment WORD offset*/
			for(cnt = 0; cnt <((pEntry->BitLength & 0xF0) >> 4); cnt++)
			{

				/*current 16Bit are skipped => clear current buffer */
				pData++;

				/*Clear new buffer*/
				*pData = 0;
			}

			/* we don't have read access */
			if ( (pEntry->ObjAccess & ACCESS_READ) == 0 )
			{
				/* it is a write only entry */
				result = ABORTIDX_WRITE_ONLY_ENTRY;
			}
			else
			{
				/* we don't have read access in this state */
				result = ABORTIDX_IN_THIS_STATE_DATA_CANNOT_BE_READ_OR_STORED;
			}
		}
	}

	if(bRead == 0)
	{
		return result;
	}

	FSP_PARAMETER_NOT_USED(Size);

	return 0;
}

/*******************************************************************************
* Function Name: Device_Reset
* Description  : This function executes the Device Reset described in ETG.5003.
* Arguments    : none
* Return Value : none
*******************************************************************************/
void Device_Reset(void)
{

    NVIC_SystemReset();    // System Software Reset
    while(1)
    {
        /* Do nothing */
    };

}

/**
 \param     index                    index of the requested object.
 \param     subindex                subindex of the requested object.
 \param    dataSize                received data size of the SDO Download
 \param    pData                    Pointer to the buffer where the written data can be copied from
 \param    bCompleteAccess    Indicates if a complete write of all subindices of the
                                     object shall be done or not

 \return    result of the write operation (0 (success) or an abort code (ABORTIDX_.... defined in
            sdosrv.h))

 \brief    This function writes the object 0xFBF0
*/
UINT8 Write0xFBF0( UINT16 index, UINT8 subindex, UINT32 dataSize, UINT16 MBXMEM * pData, UINT8 bCompleteAccess )
{
	if ( bCompleteAccess )
	{
		/* Complete Access is not supported for object 0xFBF0 */
		return ABORTIDX_UNSUPPORTED_ACCESS;
	}

	if (( subindex == 0 ) || (subindex == 2) || (subindex == 3))
	{
		/* Subindex 0, 2, 3 is not writable */
		return ABORTIDX_READ_ONLY_ENTRY;
	}

	if ((0x6574 == pData[0]) && (0x6573 == pData[1]) && (0x0072 == pData[2]))
	{
		UINT8 message[] = "Execute Device_Reset().\r\n";
		printf("%s", message);
		Device_Reset();
	}

	FSP_PARAMETER_NOT_USED(dataSize);
	FSP_PARAMETER_NOT_USED(index);

	return 0;
}

/**
 \param     index                    index of the requested object.
 \param     subindex                subindex of the requested object.
 \param    dataSize                received data size of the SDO Download
 \param    pData                    Pointer to the buffer where the written data can be copied from
 \param    bCompleteAccess    Indicates if a complete write of all subindices of the
                                     object shall be done or not

 \return    result of the write operation (0 (success) or an abort code (ABORTIDX_.... defined in
            sdosrv.h))

 \brief    This function writes the object 0xFBF2
*/
UINT8 Write0xFBF2( UINT16 index, UINT8 subindex, UINT32 dataSize, UINT16 MBXMEM * pData, UINT8 bCompleteAccess )
{
	if ( bCompleteAccess )
	{
		/* Complete Access is not supported for object 0xFBF0 */
		return ABORTIDX_UNSUPPORTED_ACCESS;
	}

	if (( subindex == 0 ) || (subindex == 2) || (subindex == 3))
	{
		/* Subindex 0, 2, 3 is not writable */
		return ABORTIDX_READ_ONLY_ENTRY;
	}

#if STORE_BACKUP_PARAMETER_IMMEDIATELY
	FSP_PARAMETER_NOT_USED(pData);
#else
	if ((0x6173 == pData[0]) && (0x6576 == pData[1]))
	{
#if BACKUP_PARAMETER_SUPPORTED

		StoreBackupEntries();

#endif // #if BACKUP_PARAMETER_SUPPORTED
	}
	else
	{
		return ABORTIDX_PARAM_IS_INCOMPATIBLE;
	}
#endif

	FSP_PARAMETER_NOT_USED(dataSize);
	FSP_PARAMETER_NOT_USED(index);

	return 0;
}
